ProgessBase/InformationRegisters/УСЗ_КалендарьРаботыСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>УСЗ_КалендарьРаботыСклада</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/УСЗ_КалендарьРаботыСклада/Ext/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
                                          
// Выполняет запись в регистр сведений "УСЗ_КалендарьРаботыСклада" данных из временной таблицы
///////////////////////////////////////////////////////////////{ООО "Автоматизация-Л" ДОРАБОТКА
// Измайлова Полина 20.06.2011 13:32 добавлен параметр процедуры "ПроизводственныйКалендарь"                                          
Процедура ЗаписатьИзТаблицыВРегистр(ТаблицаРегистра,ГодЗаписи,Склад) Экспорт

    // Очистим старые данные за год
    НаборЗаписей = РегистрыСведений.УСЗ_КалендарьРаботыСклада.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Год.Значение		 = ГодЗаписи;
	НаборЗаписей.Отбор.Год.Использование = Истина;
    
    НаборЗаписей.Отбор.Склад.Значение		 = Склад;
    НаборЗаписей.Отбор.Склад.Использование = Истина;

    НаборЗаписей.Прочитать();
    
    ЕстьЗаписиВРегистре = НаборЗаписей.Количество() > 0;
    
    // Запишем новые данные за год
    Если ЕстьЗаписиВРегистре Тогда
    	Для каждого Запись Из НаборЗаписей Цикл
    		СтрокаТаблицы = ТаблицаРегистра.Найти(Запись.ДатаКалендаря,"ДатаКалендаря");
    		Запись.ВидДня = СтрокаТаблицы.ВидДня;
    	КонецЦикла; 
    Иначе
    	Для Каждого СтрокаТаблицы ИЗ ТаблицаРегистра Цикл
    		НоваяЗаписьРегистра = НаборЗаписей.Добавить();
    		НоваяЗаписьРегистра.Склад 		  = Склад;
    		НоваяЗаписьРегистра.ДатаКалендаря = СтрокаТаблицы.ДатаКалендаря;
    		НоваяЗаписьРегистра.Год			  = Год(СтрокаТаблицы.ДатаКалендаря);
    		НоваяЗаписьРегистра.ВидДня		  = СтрокаТаблицы.ВидДня;
    	КонецЦикла; 
    КонецЕсли;
    
    // запишем набор записей
    НаборЗаписей.Записать();
			
КонецПроцедуры
